import matplotlib.pyplot as plt

# Данные для первого графика
kp_1 = [0, 0.00382, 0.00442, 0.00485, 0.00619, 0.00757, 0.00857, 0.01212]
in_1 = [0.002, 0.02, 0.024, 0.031, 0.044, 0.055, 0.078, 0.137]

# Данные для второго графика
kp_2 = [0.00, 0.00606,	0.00657,	0.00833,	0.01055,	0.01364,	0.01566,	0.02428]
in_2 = [0.002, 0.023, 0.028, 0.036, 0.057, 0.070, 0.100, 0.170]

# Создание графика
plt.figure(figsize=(8, 5))

# Построение первого графика
plt.plot(kp_1, in_1, marker='o', linestyle='-', color='blue', label='емкостный')

# Построение второго графика
plt.plot(kp_2, in_2, marker='o', linestyle='-', color='orange', label='LC-фильтр')

# Подписи осей
plt.xlabel("Кп")
plt.ylabel("Iн, А")
plt.title("Кп = f(Iн)")
plt.legend()
plt.grid()

# Отображение графика
plt.show()
